{
    "Yes": "はい",
    "No": "いいえ",
    "Don't ask again": "今後表示しない",
    "OK": "OK",
    "Open setting": "設定を開く",
    ", ": "、",
    "Unable to retrieve any key in current folder.": "現在のフォルダーから鍵を取得できません。",
    "Input the passphrase for the signing key": "署名用の鍵のパスフレーズを入力してください",
    "Input the passphrase for the signing key, passphrase cache enabled": "署名用の鍵のパスフレーズを入力してください（パスフレーズのキャッシュが有効）",
    "For the key associated with {0}": "関連付けられたユーザー: {0}",
    "Key unlocked, and the passphrase is stored in the SecretStorage of VSCode.": "鍵を解除し、パスフレーズをVSCodeのSecretStorageに保存しました。",
    "Key unlocked.": "鍵を解除しました。",
    "Failed to unlock: {0}": "解除に失敗しました: {0}",
    "There is no cached passphrase for your current key.": "現在の鍵のパスフレーズはキャッシュされていません。",
    "List of keys with stored passphrases, select to delete.": "パスフレーズが保存されている鍵の一覧です。削除する鍵を選択してください。",
    "You can search the fingerprint and user id in this search box.": "このボックスでフィンガープリントとユーザーIDを検索できます。",
    "Your cached passphrase has been deleted.": "キャッシュされたパスフレーズを削除しました。",
    "There is no cached passphrase.": "キャッシュされたパスフレーズはありません。",
    "Current key": "現在の鍵",
    "Rest keys": "その他の鍵",
    "List of keys with stored passphrases:": "パスフレーズが保存されている鍵の一覧：",
    "Do you really want to clear all your cached passphrase? This action CANNOT be reverted.": "キャッシュされたすべてのパスフレーズを削除してもよろしいですか？この操作は取り消せません。",
    "All Your cached passphrase has been cleared.": "キャッシュされたすべてのパスフレーズを削除しました。",
    "Key changed, and unlocked automatically using the previous-used stored passphrase.": "鍵が変更されました。保存されているパスフレーズで鍵を自動的に解除しました。",
    "Key re-locked, and unlocked automatically using the previous-used stored passphrase.": "鍵がロックされました。保存されているパスフレーズで鍵を自動的に解除しました。",
    "Key unlocked automatically using the previous-used stored passphrase.": "保存されているパスフレーズで鍵を自動的に解除しました。",
    "Key changed, but the previous-used stored passphrase for this key is unable to unlock the key, so the passphrase has been deleted and you need to unlock the key manually.": "鍵が変更されましたが、保存されているパスフレーズでロックを解除できないため、パスフレーズを削除しました。手動で解除してください。",
    "Key re-locked automatically, but the previous-used stored passphrase is unable to unlock the key, so the passphrase has been deleted and you need to unlock the key manually.": "鍵が自動的に再ロックされましたが、保存されているパスフレーズでロックを解除できないため、パスフレーズを削除しました。手動で解除してください。",
    "The previous-used stored passphrase is unable to unlock current key, so the passphrase has been deleted and you need to unlock the key manually.": "保存されているパスフレーズで現在の鍵のロックを解除できないため、パスフレーズを削除しました。手動で解除してください。",
    "Key changed.": "鍵が変更されました。",
    "Key re-locked.": "鍵がロックされました。",
    "No active folder": "アクティブなフォルダーがありません。",
    "No key for current folder": "現在のフォルダーに関連付けられた鍵がありません。",
    "GPG Indicator come with new passphrase cache feature, would you like to enable this feature?": "GPG Indicatorにパスフレーズのキャッシュ機能が追加されました。この機能を有効にしますか？",
    "OK, you can configure it later in setting.": "完了。後で設定から構成できます。",
    "OK, this feature has been enabled, you can configure it later in setting.": "完了。機能を有効にしました。後で設定から構成できます。"
}