{
    "Yes": "是",
    "No": "否",
    "Don't ask again": "不再询问",
    "OK": "好的",
    "Open setting": "打开设置",
    ", ": "、",
    "Unable to retrieve any key in current folder.": "无法检索当前文件夹中的任何密钥。",
    "Input the passphrase for the signing key": "输入密钥密码",
    "Input the passphrase for the signing key, securely passphrase cache enabled": "输入密钥密码，密码安全存储功能已开启",
    "For the key associated with {0}": "该密钥关联用户：{0}",
    "Key unlocked, and the passphrase is stored SECURELY in the SecretStorage of VSCode.": "密钥已解锁，密码已被安全存储在 VSCode 的机密存储区中。",
    "Key unlocked.": "密钥已解锁。",
    "Failed to unlock: {0}": "密钥解锁失败：{0}",
    "There is no cached passphrase for your current key.": "您的当前密钥的密码并未被存储",
    "List of keys with stored passphrases, select to delete.": "已存储密码的密钥列表，请选择要删除的密钥密码。",
    "You can search the fingerprint and user id in this search box.": "您可以在此处通过密钥的哈希值和关联的用户信息搜索密钥。",
    "Your cached passphrase has been deleted.": "您选择的密钥密码已被从机密存储区中删除。",
    "There is no cached passphrase.": "您没有任何密码被存储。",
    "Current key": "当前密钥",
    "Rest keys": "其他密钥",
    "List of keys with stored passphrases:": "已存储密码的密钥列表：",
    "Do you really want to clear all your cached passphrase? This action CANNOT be reverted.": "您确认真的要删除您存储中的全部密码吗？该操作无法被撤销。",
    "All Your cached passphrase has been cleared.": "您的全部密码已被从机密存储区中删除。",
    "Key changed, and unlocked automatically using the previous-used stored passphrase.": "密钥已变更，并被通过机密存储区中的关联密码自动解锁。",
    "Key re-locked, and unlocked automatically using the previous-used stored passphrase.": "密钥被自动锁定，现已被通过机密存储区中的关联密码自动解锁。",
    "Key unlocked automatically using the previous-used stored passphrase.": "密钥已被通过机密存储区中的关联密码自动解锁。",
    "Key changed, but the previous-used stored passphrase for this key is unable to unlock the key, so the passphrase has been deleted and you need to unlock the key manually.": "密钥已变更，但机密存储区中的关联密码无法解锁该密钥，故该密码已被删除，您需要手动解锁该密钥。",
    "Key re-locked automatically, but the previous-used stored passphrase is unable to unlock the key, so the passphrase has been deleted and you need to unlock the key manually.": "密钥被自动锁定，但机密存储区中的关联密码无法解锁该密钥，故该密码已被删除，您需要手动解锁该密钥",
    "The previous-used stored passphrase is unable to unlock current key, so the passphrase has been deleted and you need to unlock the key manually.": "机密存储区中的关联密码无法解锁当前密钥，故该密码已被删除，您需要手动解锁该密钥。",
    "Key changed.": "密钥已变更。",
    "Key re-locked.": "密钥被自动锁定。",
    "No active folder": "当前无活动中的文件夹。",
    "No key for current folder": "当前文件夹无关联密钥。",
    "GPG Indicator come with new passphrase cache feature, would you like to enable this feature?": "GPG Indicator 新增了密码安全存储功能，您是否希望开启这项功能？",
    "OK, you can configure it later in setting.": "好的，您可以稍后在设置处启用这项功能。",
    "OK, this feature has been enabled, you can configure it later in setting.": "好的，该功能已启用，您可以稍后在设置的处管理这项功能。"
}
